app/controllers/users_controller.rb

SELECT `types`.* FROM `types`
---
	def index
		@types = Type.all

SELECT `types`.* FROM `types`
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`type_id` = 1  ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
	def show_blog
    @types = Type.all
		type = params[:type].nil? ? 1 : params[:type].to_i
		page = params[:page].nil? ? 1 : params[:page].to_i
		unless type.nil?
			@blogs = (Blog.where(type_id: type).nil? ?  [] : Blog.where(type_id: type).order('created_at DESC').limit(10).offset((page - 1) * 10))

SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'blankmanp' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'blankmanp' AND `users`.`password` = 'blankmanp' LIMIT 1
---
	def login
		username = params[:username]
		password = params[:password]
		if User.find_by_name(username).nil?
			respond_to do |format|
				format.json { render json: {success: 0, info: '未找到该用户！'} }
			end
		else
			if User.find_by_name_and_password(username, password).nil?